Autodesk.Revit.DB.OpenOptions.SetOpenWorksetsConfiguration(Autodesk.Revit.DB.WorksetConfiguration)
Sets the object used to configure the worksets to open when the model is opened.
Remarks:
These options are ignored for non-workshared models.
openConfiguration:
The options.  If null, all user-created worksets will be opened.
Since:
2014

Autodesk.Revit.DB.OpenOptions.GetOpenWorksetsConfiguration
Gets the object used to configure the worksets to open when the model is opened.
Returns:
The options.  If null, all user-created worksets will be opened.
Since:
2014

Autodesk.Revit.DB.OpenOptions.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.OpenOptions.OpenForeignOption
An option that specifies how to open files saved by an application that was not developed or licensed by Autodesk.
The default value is OpenForeignOption.Open.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2019.2

Autodesk.Revit.DB.OpenOptions.AllowOpeningLocalByWrongUser
Specifies whether a local file is allowed to be opened as read-only by a user other than its owner.
Remarks:
The default is false.  This option is ignored for central and non-workshared models.
Since:
2014

Autodesk.Revit.DB.OpenOptions.Audit
Specifies whether to expand all elements in order to check for corruption.
Remarks:
The default is false.  Setting this to true will increase the time and memory required to open the file.
Since:
2014

Autodesk.Revit.DB.OpenOptions.IgnoreExtensibleStorageSchemaConflict
Specifies whether to ignore the error of schema conflict.
Remarks:
The default is false.  Setting this to true will ignore the exception of schema conflict while opening the model.
Data in the existing schema with the same ID will be erased from the model.
Since:
2013

Autodesk.Revit.DB.OpenOptions.DetachFromCentralOption
An option that specifies whether or not a workset-enabled document is detached from its central document.
The default value is DetachFromCentralOption.DoNotDetach.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2013

Autodesk.Revit.DB.OpenOptions.#ctor
Constructs a new instance of the options class using default values.
Since:
2013

Autodesk.Revit.DB.OpenOptions
This class contains options available for opening a document from disk.
Since:
2013